tap "1password/tap"
tap "aws/tap"
tap "bridgecrewio/tap"
tap "common-fate/granted"
tap "dflemstr/tools"
tap "homebrew/bundle"
tap "marhaupe/json2struct", "https://github.com/marhaupe/json2struct"
tap "romkatv/powerlevel10k"
tap "turbot/tap"
tap "universal-ctags/universal-ctags"
tap "vectordotdev/brew"
tap "warrensbox/tap"
brew "aws-nuke"
brew "bash"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "python@3.12"
brew "blueutil"
brew "cliclick"
brew "cloud-nuke"
brew "codespell"
brew "difftastic"
brew "diffutils"
brew "direnv"
brew "docker-credential-helper-ecr"
brew "dockutil"
brew "dust"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "gitui"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goreleaser"
brew "graphviz"
brew "grep"
brew "grip"
brew "hadolint"
brew "htop"
brew "imagemagick"
brew "infracost"
brew "ipcalc"
brew "jc"
brew "jq"
brew "node"
brew "jupyterlab", link: false
brew "lftp"
brew "libpq"
brew "moreutils", link: false
brew "neovim"
brew "nmap"
brew "node@16"
brew "openjdk"
brew "openjdk@17"
brew "openvpn"
brew "parallel"
brew "pkgconf"
brew "powerlevel10k"
brew "prettier"
brew "promtail"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "pyvim"
brew "shellcheck"
brew "shfmt"
brew "source-highlight"
brew "sponge", link: false
brew "telnet"
brew "terraform-docs"
brew "the_silver_searcher"
brew "trivy"
brew "universal-ctags", args: ["HEAD"]
brew "viddy"
brew "vim"
brew "watch"
brew "websocat"
brew "wget"
brew "yq"
brew "zsh"
brew "bridgecrewio/tap/yor"
brew "common-fate/granted/granted"
brew "marhaupe/json2struct/json2struct"
brew "turbot/tap/steampipe"
brew "vectordotdev/brew/vector"
brew "warrensbox/tap/tfswitch"
cask "1password-cli"
cask "rq"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "zainchen.json"
